DocumentJournals/СкладскиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DocumentJournal>
		<Properties>
			<Name>СкладскиеДокументы</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ОтпускТоваровВОтделение</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.РазмещениеТоваровПоМестамХранения</xr:Item>
				<xr:Item>Document.ВнутреннееПотреблениеТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ПередачаТоваровНаСторону</xr:Item>
				<xr:Item>Document.ВозвратТоваровИзОтделения</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Склад</Name>
					<References>
						<xr:Item>Document.РазмещениеТоваровПоМестамХранения.Attribute.Склад</xr:Item>
						<xr:Item>Document.ОтпускТоваровВОтделение.Attribute.СкладОтправитель</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.СкладОтправитель</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Склад</xr:Item>
						<xr:Item>Document.ПрочееОприходованиеТоваров.Attribute.Склад</xr:Item>
						<xr:Item>Document.ПередачаТоваровНаСторону.Attribute.Склад</xr:Item>
						<xr:Item>Document.ВозвратТоваровИзОтделения.Attribute.СкладОтправитель</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.РазмещениеТоваровПоМестамХранения.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОтпускТоваровВОтделение.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПрочееОприходованиеТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаТоваровНаСторону.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВозвратТоваровИзОтделения.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.РазмещениеТоваровПоМестамХранения.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОтпускТоваровВОтделение.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПрочееОприходованиеТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаТоваровНаСторону.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВозвратТоваровИзОтделения.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ОтпускТоваровВОтделение.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РазмещениеТоваровПоМестамХранения.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПрочееОприходованиеТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаТоваровНаСторону.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВозвратТоваровИзОтделения.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СкладПолучатель</Name>
					<References>
						<xr:Item>Document.ОтпускТоваровВОтделение.Attribute.СкладПолучатель</xr:Item>
						<xr:Item>Document.ПеремещениеТоваров.Attribute.СкладПолучатель</xr:Item>
						<xr:Item>Document.ВозвратТоваровИзОтделения.Attribute.СкладПолучатель</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

DocumentJournals/СкладскиеДокументы/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформлениеФормы();
	ТипыДокументов = Новый ФиксированныйМассив(ШтрихкодированиеПечатныхФорм.ТипыОбъектовДинамическогоСписка(ЖурналДокументов));
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ПодключаемоеОборудование
	ПодключаемоеОборудованиеСервер.НастроитьФормуДляИспользованияПодключаемогоОборудования(ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиБольничнаяАптека.ПриСозданииНаСервере_ФормаСпискаДокумента(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБольничнаяАптека.ЗаполнитьСписокПользователейСПравомИзменения(Элементы.ОтборОтветственный.СписокВыбора, ТипыДокументов);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяСписка", Элементы.ЖурналДокументов.ПутьКДанным);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ЖурналДокументовГруппаСоздать.Имя);
	НастройкаФормБольничнаяАптека.ФормаЖурналаДокументов_ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	НастроитьОтборПоСкладу();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналДокументов, "Организация"  , ОтборОрганизация  ,,, ЗначениеЗаполнено(ОтборОрганизация));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналДокументов, "Ответственный", ОтборОтветственный,,, ЗначениеЗаполнено(ОтборОтветственный));
	
	ОбработатьИзменениеСклада();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если ПодключаемоеОборудованиеКлиент.ОбрабатыватьОповещение(ЭтотОбъект, Источник) Тогда
		Если ПодключаемоеОборудованиеКлиент.ОбработатьПолучениеДанныхОтСканераШтрихкода(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбработатьШтрихкоды(ОбщегоНазначенияБольничнаяАптекаКлиентСервер.ПолучитьДанныеШтрихкода(Параметр, 1));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиБольничнаяАптекаКлиент.ОбработкаОповещения_ФормаСпискаДокумента(ЭтотОбъект, ИмяСобытия, Параметр, Источник, "ЖурналДокументов");
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_СоздатьОбъект(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
	ЗначенияЗаполнения.Вставить("Склад", ОтборСклад);
	ЗначенияЗаполнения.Вставить("СкладОтправитель", ОтборСклад);
	
	ОбщегоНазначенияБольничнаяАптекаКлиентСервер.УдалитьНезаполненныеЗначенияИзСтруктуры(ЗначенияЗаполнения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ." + Команда.Имя + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналДокументов, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
	
	ОбработатьИзменениеСклада();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ОтборСклад) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналДокументов, "Ответственный", ОтборОтветственный,,, ЗначениеЗаполнено(ОтборОтветственный));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ОтборОтветственный) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиБольничнаяАптекаКлиент.СписокВыбор_ФормаСпискаДокумента(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналДокументовПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриАктивизацииСтроки_ФормаСписка(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЖурналДокументовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентами.ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	ОбработкаТабличнойЧастиСервер.УстановитьОформлениеПоляДата(ЭтотОбъект, "ЖурналДокументов");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСклада()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЖурналДокументов, Неопределено, ОтборСклад,, "ОтборСклада", ЗначениеЗаполнено(ОтборСклад));
	
	Если ЗначениеЗаполнено(ОтборСклад) Тогда
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад", ОтборСклад));
	Иначе
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура, "Склад");
	КонецЕсли;
	
	КомандыСоздания = Элементы.ЖурналДокументовГруппаСоздать.ПодчиненныеЭлементы;
	НастройкаФормБольничнаяАптека.УстановитьВидимостьКомандСозданияПоФункциональнымОпциям(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	ШтрихкодированиеПечатныхФормКлиент.СпозиционироватьсяНаСсылкеПоШтрихкодуТабличногоДокумента(Элементы.ЖурналДокументов, ДанныеШтрихкода.Штрихкод, ТипыДокументов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтборПоСкладу()
	
	Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ЖурналДокументов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
		"ГруппаОтборСклада",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "Склад",,, "ОтборСклада", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Группа, "СкладПолучатель",,, "ОтборСклада", Ложь);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ПОДСИСТЕМЫ
#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ЖурналДокументов);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ЖурналДокументов, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ЖурналДокументов);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ЭлектронноеВзаимодействие.ОбменСКонтрагентами

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Элементы.ЖурналДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВидимостьСостоянияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОбновленияВидимостьСостоянияЭДО(ЭтотОбъект, Элементы.ПредставлениеСостояния);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыЭДО()
	ОбменСКонтрагентамиКлиент.ОбновитьКоманды(ЭтотОбъект, Элементы.ЖурналДокументов);
КонецПроцедуры

// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

#КонецОбласти // СтандартныеПодсистемы
